#---------------------- ПЕРЕМЕННЫЕ ДЛЯ САЙТОВ-ДОРВЕЕВ ------------------------#

#--------------------------Шапка
Шапка_Вернуться_на_Главную = '//*[@id="t_home"]'
Шапка_Афиша_и_Билеты = '//*[@id="t_afisha"]'
Шапка_Подарочные_Сертификаты='//*[@id="t_certificates"]'
Шапка_Гарантии='//*[@id="t_guarantee"]'
Шапка_Поиск='//*[@id="t_search"]'
Шапка_Корзина='//*[@id="t_cart"]'
Шапка_Меню='//*[@id="t_menu"]'
Шапка_Язык_RU="//div[contains(@class,'header_wr')]//form[contains(@class,'active')]"
Шапка_Список_Языков='//div[@class="header transparent"]//form[*]//input[3]'
Шапка_обертка='//*[@class="header_lang__wrp"]'
#--------------------ГЛАВНАЯ СТРАНИЦА---------------------------
Главная_Афиша_и_Билеты='//*[@id="t_afisha_button"]'
Главная_Загрузить_Месяц='//*[@id="t_load"]'
# Блок фильтра //*[@id="t_filters"]



#--------------------Страница сертификаты
Сертификат_Выберите_сертификат = '//*[@id="t_c_choose"]'
Сертификат_Список_сертификатов = '//*[@class="cert_certs__button"]'

#Наименование сертифика   //div[contains(@class,"cert_certs")]//article[1]//div[1]//h3[1]
Сертификат_Наименование_Сертификата_ = '//div[contains(@class,"cert_certs")]//article['
Сертификат_Наименование_Сертификата_продолжение = "]//div[1]//h3[1]"

#Кнопка "Выбрать"   //div[contains(@class,"cert_certs")]//article[1]//div[1]//h3[1]
#${Сертификат_Кнопка_Выбрать_}${index +1}${Сертификат_Кнопка_Выбрать_продолжение}
Сертификат_Кнопка_Выбрать_ = '//article['
Сертификат_Кнопка_Выбрать_продолжение = ']//div[1]//div[1]//div[1]'

Сертификат_Кнопка_Продолжить = "//div[@class='cert_button cert_button-next go_to_2']"
# наименование сертификата на 2 странице
Сертификат_Наименование_Сертификата2 = "//div[contains(@class,'cert_window__sm_reason')][1]"
Сертификат_Кнопка_Оформить='//*[@id="certificate-form-submit"]'

Сертификат_Шаблон_Главный='//*[@id="certificate-form"]/div[1]/div/div[2]/div[1]/div[2]/div/div[1]'
Сертификат_Шаблон_Дизайна_1='//*[@id="certificate-form"]/div[1]/div/div[2]/div[2]/div[2]/div[1]'
Сертификат_Шаблон_Дизайна_2='//*[@id="certificate-form"]/div[1]/div/div[2]/div[2]/div[2]/div[2]'
Сертификат_Шаблон_Дизайна_3='//*[@id="certificate-form"]/div[1]/div/div[2]/div[2]/div[2]/div[3]'

# Поля в форме заказа сертификатов
Сертификат_Поле_Формы_Email = '//*[@id="mail"]'
Сертификат_Поле_Формы_Phone = '//*[@id="tel"]'
Сертификат_Поле_Формы_Сообщение = '//*[@id="text"]'


#--------------------Страница корзины
# Поля в форме заказа, на страницы корзины
Корзина_Поле_Формы_Name = '//*[@name="name"]'
Корзина_Поле_Формы_Surname = '//*[@name="surname"]'
Корзина_Поле_Формы_Phone = '//*[@name="phone"]'
Корзина_Поле_Формы_Email = '//*[@name="email"]'
Корзина_Поле_Формы_Address = '//*[@name="address"]'
Корзина_Поле_Формы_Comment = '//*[@name="comment"]'
Корзина_Кнопка_Оформить_Заказ = '//*[@id="cart-order-form"]/div[2]/div[6]/div[1]/div'
Корзина_Кнопка_Оформить_Заказ_Js = "#cart_submit"


#--------------------Меню сайта------
Меню_Поле_ссылок = '/html[1]/body[1]/div[5]/nav[1]//a'






#---------------------- ПЕРЕМЕННЫЕ ДЛЯ БИНТРАНЕТА ------------------------#

#------------- Страница авторизации -----------------#
Имя_Пользователя_Bintranet = '//*[@id="id_username"]'
Пароль_Пользователя_Bintranet = '//*[@id="id_password"]'
Кнопка_Войти = '//*[@value="Войти"]'
Правая_Панель = '//*[@id="djHideToolBarButton"]'
Ссылка_На_Профиль_Пользователя = '//a[@class="header__main__user__link"]'
Ссылка_Выход = '//a[@href="/accounts/logout/"]'
Название_Аккаунта = '//a[@class="header__main__user__link"]/span[1]'
Синий_Фон_страницы = '//*[@id="modal-loading"]'